<?
session_start(); //Без этого сессия работать не будет
    
    $_SESSION['name'] = $_POST['name']; //Передаём в сессию значения введённые в поле name
    $_SESSION['email'] = $_POST['email'];   //Передаём в сессию значения введённые в поле email

setcookie("name", $_POST['name'], time() + 3600);   //Передаём в куки значения введённые в поле name
setcookie("email", $_POST['email'], time() + 3600); //Передаём в куки значения введённые в поле email

//time() + n - Время жизни куки в секундах. В данном случае это час.
//Первый параметр - название определённой куки
//Второй параметр - значение этой куки.
    
header ('Location: /Cookie/');  //Редирект на страницу с полями
die();
?>